In [1]:
import pandas as pd
import pandas_profiling as pp

import numpy as np

In [2]:
# reading all the sheets to see what tabs are present
df = pd.read_excel('/content/KPMG_VI_New_raw_data_update_final.xlsx', sheet_name=None)

print(df.keys())

dict_keys(['Title Sheet', 'Transactions', 'NewCustomerList', 'CustomerDemographic', 'CustomerAddress'])

In [3]:
#reading each sheet into a dataframe except the title sheet
df_list = [] #holiding all dataframes

for sheet in df.keys():
  if sheet == "Title Sheet":
    pass
  else:
    df = pd.read_excel('/content/KPMG_VI_New_raw_data_update_final.xlsx', sheet_name=sheet,skiprows = 1) #skipping first discloure row
    df.name = sheet
    df_list.append(df)

In [4]:
df_list

[       transaction_id  product_id  ...  standard_cost product_first_sold_date
 0                   1           2  ...          53.62                 41245.0
 1                   2           3  ...         388.92                 41701.0
 2                   3          37  ...         248.82                 36361.0
 3                   4          88  ...         381.10                 36145.0
 4                   5          78  ...         709.48                 42226.0
 ...               ...         ...  ...            ...                     ...
 19995           19996          51  ...        1203.40                 37823.0
 19996           19997          41  ...         312.74                 35560.0
 19997           19998          87  ...          44.71                 40410.0
 19998           19999           6  ...         136.73                 38216.0
 19999           20000          11  ...        1580.47                 36334.0

 [20000 rows x 13 columns],
     first_name  last_name  gender  ...  Unnamed: 20  Rank     Value
 0      Chickie    Brister    Male  ...            1     1  1.718750
 1        Morly     Genery    Male  ...            1     1  1.718750
 2      Ardelis  Forrester  Female  ...            1     1  1.718750
 3       Lucine      Stutt  Female  ...            4     4  1.703125
 4      Melinda     Hadlee  Female  ...            4     4  1.703125
 ..         ...        ...     ...  ...          ...   ...       ...
 995  Ferdinand  Romanetti    Male  ...          996   996  0.374000
 996       Burk    Wortley    Male  ...          997   997  0.357000
 997   Melloney      Temby  Female  ...          997   997  0.357000
 998     Dickie    Cubbini    Male  ...          997   997  0.357000
 999      Sylas    Duffill    Male  ...         1000  1000  0.340000

 [1000 rows x 23 columns],
       customer_id      first_name  ... owns_car tenure
 0               1         Laraine  ...      Yes   11.0
 1               2             Eli  ...      Yes   16.0
 2               3           Arlin  ...      Yes   15.0
 3               4          Talbot  ...       No    7.0
 4               5  Sheila-kathryn  ...      Yes    8.0
 ...           ...             ...  ...      ...    ...
 3995         3996         Rosalia  ...       No   19.0
 3996         3997          Blanch  ...      Yes    1.0
 3997         3998          Sarene  ...       No    NaN
 3998         3999       Patrizius  ...      Yes   10.0
 3999         4000           Kippy  ...       No   11.0

 [4000 rows x 13 columns],
       customer_id                    address  ...    country property_valuation
 0               1         060 Morning Avenue  ...  Australia                 10
 1               2        6 Meadow Vale Court  ...  Australia                 10
 2               4         0 Holy Cross Court  ...  Australia                  9
 3               5        17979 Del Mar Point  ...  Australia                  4
 4               6           9 Oakridge Court  ...  Australia                  9
 ...           ...                        ...  ...        ...                ...
 3994         3999            1482 Hauk Trail  ...  Australia                  3
 3995         4000  57042 Village Green Point  ...  Australia                  6
 3996         4001     87 Crescent Oaks Alley  ...  Australia                 10
 3997         4002           8194 Lien Street  ...  Australia                  7
 3998         4003            320 Acker Drive  ...  Australia                  7

 [3999 rows x 6 columns]]

Data Profiling

In [5]:
for df in df_list:
  profile = pp.ProfileReport(df)
  output_file = df.name+"_data_profile.html"
  profile.to_file(output_file=output_file)

'for df in df_list:\n  profile = pp.ProfileReport(df)\n  output_file = df.name+"_data_profile.html"\n  profile.to_file(output_file=output_file)'

In [6]:
# lets analyze one by one

# picking customer address

In [26]:
CustomerAddress = df_list[3]

In [27]:
CustomerAddress.head(5)

   customer_id              address  ...    country property_valuation
0            1   060 Morning Avenue  ...  Australia                 10
1            2  6 Meadow Vale Court  ...  Australia                 10
2            4   0 Holy Cross Court  ...  Australia                  9
3            5  17979 Del Mar Point  ...  Australia                  4
4            6     9 Oakridge Court  ...  Australia                  9

[5 rows x 6 columns]

Address looks pretty clean surpringly except of 3 addresses which are repeated twice.

In [28]:
CustomerAddress[CustomerAddress.duplicated(['address'])]

      customer_id                  address  ...    country property_valuation
2470         2475         3 Talisman Place  ...  Australia                  5
2980         2985  3 Mariners Cove Terrace  ...  Australia                 10
3535         3540   64 Macpherson Junction  ...  Australia                  8

[3 rows x 6 columns]

In [29]:
CustomerAddress.loc[CustomerAddress['address'] == '64 Macpherson Junction']

      customer_id                 address  ...    country property_valuation
2315         2320  64 Macpherson Junction  ...  Australia                 11
3535         3540  64 Macpherson Junction  ...  Australia                  8

[2 rows x 6 columns]

In [30]:
CustomerAddress.loc[CustomerAddress['address'] == '3 Mariners Cove Terrace']

      customer_id                  address  ...    country property_valuation
2328         2333  3 Mariners Cove Terrace  ...  Australia                 10
2980         2985  3 Mariners Cove Terrace  ...  Australia                 10

[2 rows x 6 columns]

In [31]:
CustomerAddress.loc[CustomerAddress['address'] == '3 Talisman Place']

      customer_id           address  ...    country property_valuation
732           737  3 Talisman Place  ...  Australia                  2
2470         2475  3 Talisman Place  ...  Australia                  5

[2 rows x 6 columns]

In [32]:
#postcode can be duplicated for various address, looks pretty clean otherwise
#state looks fine as well

# but can there be different address for same postcode and state?

In [33]:
CustomerAddress[CustomerAddress.duplicated(['postcode', 'state'])]

      customer_id                    address  ...    country property_valuation
18             21            18 Jenna Center  ...  Australia                  7
19             24           3 Cordelia Plaza  ...  Australia                 10
26             31        2294 Pleasure Place  ...  Australia                 12
44             49       3107 Calypso Terrace  ...  Australia                  9
60             65          308 Jana Crossing  ...  Australia                 10
...           ...                        ...  ...        ...                ...
3994         3999            1482 Hauk Trail  ...  Australia                  3
3995         4000  57042 Village Green Point  ...  Australia                  6
3996         4001     87 Crescent Oaks Alley  ...  Australia                 10
3997         4002           8194 Lien Street  ...  Australia                  7
3998         4003            320 Acker Drive  ...  Australia                  7

[3005 rows x 6 columns]

In [34]:
CustomerAddress.loc[(CustomerAddress['postcode'] == 2251) & (CustomerAddress['state'] == 'NSW')]

      customer_id                     address  ...    country property_valuation
340           345       08 Ronald Regan Plaza  ...  Australia                  9
1191         1196        894 Maple Wood Drive  ...  Australia                 10
1492         1497        7049 Sutteridge Lane  ...  Australia                  8
1576         1581  45314 Pepper Wood Junction  ...  Australia                  6
1799         1804            3 Mallard Center  ...  Australia                  8
3998         4003             320 Acker Drive  ...  Australia                  7

[6 rows x 6 columns]


*Summary For Customer Address table-*

1. There is data only for a country- Australia

2. State names are duplicated, data only for 3 states, NSW, Queensland and Victoria

3. Why porperty evaluation is included?

4. 3 address are same for different customers for state and postcode

In [35]:
#lets check Customerdemographic

CustomerDemo = df_list[2]
CustomerDemo.head(5)

   customer_id      first_name  ... owns_car tenure
0            1         Laraine  ...      Yes   11.0
1            2             Eli  ...      Yes   16.0
2            3           Arlin  ...      Yes   15.0
3            4          Talbot  ...       No    7.0
4            5  Sheila-kathryn  ...      Yes    8.0

[5 rows x 13 columns]

In [36]:
#customer first names can be same, let's check customers whcre the same Tobe

In [37]:
CustomerDemo.loc[CustomerDemo['first_name'] == 'Tobe']

      customer_id first_name last_name  ...          default  owns_car tenure
508           509       Tobe   Vamplew  ...       ,./;'[]\-=       Yes   21.0
1990         1991       Tobe   Godrich  ...              âââ       Yes    8.0
2076         2077       Tobe  Lindroos  ...       !@#$%^&*()       Yes    7.0
2180         2181       Tobe     Roxby  ...  ÅâÂ´â°ËÃÂ¨ËÃâââ       Yes    8.0
2566         2567       Tobe    Spirit  ...              ï»¿        No   22.0

[5 rows x 13 columns]

In [ ]:
def data_cleaning():
  #apply upper case
  #apply trim
  pass

In [40]:
#first name looks pretty all right but last name has 3.1% missing values.

#lets check if first name and last name are unique

#chaning everything to upper case, and apply ltrim rtrim 

CustomerDemo['first_name'] = CustomerDemo['first_name'].str.upper()
CustomerDemo['first_name'] = CustomerDemo['first_name'].str.strip()

CustomerDemo['last_name'] = CustomerDemo['last_name'].str.upper()
CustomerDemo['last_name'] = CustomerDemo['last_name'].str.strip()

In [43]:
CustomerDemo[CustomerDemo.duplicated(['last_name', 'first_name'])]

      customer_id    first_name last_name  ... default  owns_car tenure
1350         1351  LORETTALORNA       NaN  ...     NaN        No    NaN
1904         1905     CORABELLE       NaN  ...  00ËÆ$-        No   15.0

[2 rows x 13 columns]

In [ ]:
#gender needs cleaning as well,there is a category "U" , how to keep that?

In [44]:
from datetime import date, datetime

In [45]:
date.today()

datetime.date(2021, 7, 29)

In [58]:
#let's check DOB

#there are missing entries for 87 customers, lets check age based on the DOB

CustomerDemo['age'] = ((pd.Timestamp.now().normalize()- CustomerDemo['DOB'])/np.timedelta64(1, 'Y'))

In [60]:
CustomerDemo.loc[CustomerDemo['age'] >= 100]

    customer_id first_name last_name gender  ...  default owns_car tenure        age
33           34   JEPHTHAH  BACHMANN      U  ...      NaN       No   20.0  177.60529

[1 rows x 14 columns]

In [70]:
CustomerDemo['year'], CustomerDemo['month'],CustomerDemo['day'] = CustomerDemo['DOB'].dt.year, CustomerDemo['DOB'].dt.month,CustomerDemo['DOB'].dt.day

In [68]:
CustomerDemo.loc[CustomerDemo['year'] <= 1921]

    customer_id first_name last_name gender  ...  tenure        age    year month
33           34   JEPHTHAH  BACHMANN      U  ...    20.0  177.60529  1843.0  12.0

[1 rows x 16 columns]

In [69]:
CustomerDemo.loc[CustomerDemo['month'] > 12]

Empty DataFrame
Columns: [customer_id, first_name, last_name, gender, past_3_years_bike_related_purchases, DOB, job_title, job_industry_category, wealth_segment, deceased_indicator, default, owns_car, tenure, age, year, month]
Index: []

In [71]:
CustomerDemo.loc[CustomerDemo['day'] > 31]

Empty DataFrame
Columns: [customer_id, first_name, last_name, gender, past_3_years_bike_related_purchases, DOB, job_title, job_industry_category, wealth_segment, deceased_indicator, default, owns_car, tenure, age, year, month, day]
Index: []

In [ ]:
#there is a customer with 178 years of age and is not deceased yet.